# Tasks 
     1. Calculation of sales revenue(the product of sales quantity and unit_price) 
     2. Caluculation of sales revenue including discounts(as mentioned in the promotion table)
     3. Calculation of sales revenue including discounts and the demand adjustment factor

In [11]:
from matplotlib import pyplot as plt
import pandas as pd

In [18]:
# Read xlsx file
file_name = "SalesData_Input.xlsx"
df = pd.read_excel(file_name, sheet_name=0)  # first sheet
df.head()

         Date  Product ID  Shop Code  Number Sold  Unit Price
0  1404/01/01           1          3          200       90000
1  1404/01/01           1          3            4      142000
2  1404/01/01           1          3            2      150000
3  1404/01/01           1          3            1      169000
4  1404/01/01           1          3            2      211000

In [ ]:
# sales revenue | محاسبه حجم ریالی فروش

# number of products
unique_numbers = df["Product ID"].unique()
n_products = len(unique_numbers)
print(f"Number of Products: {n_products}")

# sales revenue for each record
df["sales_revenue"] = df["Number Sold"] * df["Unit Price"]

# Total sales revenue
summary = df.groupby("Product ID").agg(
   Total_sales_revenue=("sales_revenue", "sum")
).reset_index()
summary.head(n_products)

Number of Products: 20

    Product ID  Total_sales_revenue
0            1             52163000
1           69               600000
2          304            428400000
3          305           1585270000
4          308            101050000
5          311            435100000
6          313           1025210000
7          318            468640000
8          408           1101640000
9          409           1579820000
10         414           1313890000
11         415           1346850000
12         417             13170000
13         419           1266390000
14         422            156880000
15         423             87450000
16         668            270900000
17         669            186150000
18         720            364080000
19         723            114660000

In [41]:
summary.to_excel("summary_total_sales_revenue.xlsx", index=False)
print("File is created ...")

File is created ...